Revit 2027 API
DockablePane.Hide Method
 If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Hide()
Public Sub Hide
public:
void Hide()
member Hide : unit -> unit
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace